server/app/controllers/api/v1/games_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @game = Game.find(params[:id])

INSERT INTO "games" ("user_id", "first_win", "second_win", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["first_win", 0], ["second_win", 0], ["created_at", "2019-01-22 23:52:30.562783"], ["updated_at", "2019-01-22 23:52:30.562783"]]
---
  def create
    @game = Game.create(game_params)

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "games" SET "second_win" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["second_win", 1], ["updated_at", "2019-01-23 15:50:36.484818"], ["id", 4]]
---
  def update
    @game = Game.find(params[:id])
    @game.update(game_params)