server/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("username", "streak", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "gtojdhrt"], ["streak", 0], ["created_at", "2019-01-23 15:50:14.780484"], ["updated_at", "2019-01-23 15:50:14.780484"]]
---
  def create
    @user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 70], ["LIMIT", 1]]
UPDATE "users" SET "streak" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["streak", 1], ["updated_at", "2019-01-23 19:15:11.986840"], ["id", 43]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)